БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФМДЛП/УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФМДЛП</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОВыпускеГотовойПродукцииЗаПределамиРФМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковщик</name>
    <comment>Производитель, осуществивший упаковку/фасовку во вторичную (третичную) упаковку</comment>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролирующийКачество</name>
    <comment>Производитель, осуществивший выпускающий контроль качества</comment>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТаможенногоКонтроля</name>
    <type>
      <types>CatalogRef.ЗоныТаможенногоКонтроляМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСерии</name>
    <type>
      <types>DefinedType.НомерПроизводственнойСерииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУказанияСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПодтверждения</name>
    <type>
      <types>EnumRef.СостоянияПодтвержденияМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередачаСведенийЧерезСКЗКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераУпаковок</name>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерУпаковкиМДЛП</types>
      </type>
    </attributes>
    <attributes>
      <name>Отклонено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/СтатусыУпаковокМДЛП/СтатусыУпаковокМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыУпаковокМДЛП</name>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>ВРезерве</name>
  </enumValues>
  <enumValues>
    <name>ВыбылаИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетВыпуска</name>
  </enumValues>
  <enumValues>
    <name>ПереданаНаУничтожение</name>
  </enumValues>
  <enumValues>
    <name>КПоступлению</name>
  </enumValues>
  <enumValues>
    <name>ВУпаковке</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженВРФ</name>
  </enumValues>
  <enumValues>
    <name>ВвезенНаТерриториюРФ</name>
  </enumValues>
  <enumValues>
    <name>Задекларирована</name>
  </enumValues>
  <enumValues>
    <name>ПереданаДляМаркировкиВЗТК</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтгрузкиВРФ</name>
  </enumValues>
  <enumValues>
    <name>МаркированаВЗТК</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтвержденияИмпортером</name>
  </enumValues>
  <enumValues>
    <name>ОборотПриостановлен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтвержденияСменыСобственника</name>
  </enumValues>
  <enumValues>
    <name>Реэкспорт</name>
  </enumValues>
  <enumValues>
    <name>Перемаркирована</name>
  </enumValues>
  <enumValues>
    <name>Уничтожена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаСкладИзЗТК</name>
  </enumValues>
  <enumValues>
    <name>Эмитирована</name>
  </enumValues>
  <enumValues>
    <name>НеИспользована</name>
  </enumValues>
  <enumValues>
    <name>ВыбылаИзОборотаСОшибкой</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеОВыпускеГотовойПродукцииЗаПределамиРФМДЛП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Схема 321 удалена из набора, начиная с версии 1.36.
	ВызватьИсключение НСтр("ru = 'Уведомление о выпуске и маркировке готовой продукции за пределами РФ поддерживает только загрузку информации из СУЗ. Создание нового документа недоступно.'");
	
	СостояниеПодтверждения = Метаданные().Реквизиты.СостояниеПодтверждения.ЗначениеЗаполнения;
	ПередачаСведенийЧерезСКЗКМ = Ложь;
	НомераУпаковок.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьХарактеристикиНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Характеристика");
	КонецЕсли;
	
	Если Не ИнтеграцияМДЛП.ИспользоватьСерииНоменклатуры() Тогда
		НепроверяемыеРеквизиты.Добавить("Серия");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоденДо) И ГоденДо <= НачалоДня(Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания срока годности не может быть меньше даты выпуска.'"), ЭтотОбъект, "ГоденДо",, Отказ);
	КонецЕсли;
	
	ИнтеграцияМДЛП.ПроверитьЗаполнениеУпаковок(ЭтотОбъект, Отказ, 30000);
	
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	ИнтеграцияМДЛП.ПроверитьВозможностьЗаписиУведомления(ЭтотОбъект, РежимЗаписи);
	
	ИнтеграцияМДЛППереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = ИнтеграцияМДЛП.ПараметрыОперацииИзмененияСтатусаУпаковок();
	
	ТоварМаркированВЗТК = ЗначениеЗаполнено(ЗонаТаможенногоКонтроля);
	Если ТоварМаркированВЗТК Тогда
		ПараметрыОперации.ИсходныйСтатус                      = Перечисления.СтатусыУпаковокМДЛП.ПереданаДляМаркировкиВЗТК;
		ПараметрыОперации.НовыйСтатус                         = Перечисления.СтатусыУпаковокМДЛП.МаркированаВЗТК;
		ПараметрыОперации.ИспользуетсяЗонаТаможенногоКонтроля = Истина;
		ПараметрыОперации.ИсходнаяЗонаТаможенногоКонтроля     = ЗонаТаможенногоКонтроля;
		ПараметрыОперации.НоваяЗонаТаможенногоКонтроля        = ЗонаТаможенногоКонтроля;
	Иначе
		ПараметрыОперации.ИсходныйСтатус = Перечисления.СтатусыУпаковокМДЛП.Эмитирована;
		ПараметрыОперации.НовыйСтатус    = Перечисления.СтатусыУпаковокМДЛП.ОжидаетОтгрузкиВРФ;
	КонецЕсли;
	ПараметрыОперации.МестоДеятельности = Организация;
	
	ИнтеграцияМДЛП.ПровестиДокументПоРегиструУпаковок(Ссылка, ПараметрыОперации, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияМДЛППереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ОтменитьРезерв(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
